Revit 2026 API

# SpatialFieldManagerRegisterResult Method

---

Registers result and assigns it a unique result index

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int RegisterResult(
	AnalysisResultSchema resultSchema
)
```
```vb
Public Function RegisterResult (
	resultSchema As AnalysisResultSchema
) As Integer
```
```cpp
public:
int RegisterResult(
	AnalysisResultSchema^ resultSchema
)
```
```fsharp
member RegisterResult :
        resultSchema : AnalysisResultSchema -> int
```

#### Parameters

resultSchema AnalysisResultSchema
     Result schema to be registered

#### Return Value

Int32 Unique index assigned to the result

| Exception | Condition |
| --- | --- |
| ArgumentException | name of resultSchema is not unique in view |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace